In [17]:
import pandas as pd
import requests

# download the file from the URL
url = 'https://github.com/ckunalgit/datasets/raw/main/zomato.xlsx'
response = requests.get(url)
with open('zomato.xlsx', 'wb') as f:
    f.write(response.content)

# read the downloaded file using pandas
df1 = pd.read_excel('zomato.xlsx', sheet_name='Sheet2', skiprows=2, usecols='A:D')
df2 = pd.read_excel('zomato.xlsx', sheet_name='Sheet2', skiprows=2, usecols='G:J')

In [18]:
df1.shape

(80, 4)

In [19]:
df2.shape

(80, 4)

In [20]:
df1.head(5)

   Restaurant ID         Restaurant Name  Country Code              City
0        6317637        Le Petit Souffle           162       Makati City
1        6304287        Izakaya Kikufuji           162       Makati City
2        6300002  Heat - Edsa Shangri-La           162  Mandaluyong City
3        6318506                    Ooma           162  Mandaluyong City
4        6314302             Sambo Kojin           162  Mandaluyong City

In [21]:
df2.head(5)

   Restaurant ID.1 Restaurant Name.1  Country Code.1       City.1
0              1.0     Havana resort            91.0  Mexico city
1              2.0       Chill chill            91.0       Huwaei
2              NaN               NaN             NaN          NaN
3              NaN               NaN             NaN          NaN
4              NaN               NaN             NaN          NaN

In [22]:
# drop rows containing NaN values from df2
df2 = df2.dropna(how='all')

# print the first 5 rows of df2
df2.shape

(2, 4)

In [24]:
df2.head(5)

   Restaurant ID.1 Restaurant Name.1  Country Code.1       City.1
0              1.0     Havana resort            91.0  Mexico city
1              2.0       Chill chill            91.0       Huwaei

In [26]:
# concatenate df1 and df2 vertically
result = pd.concat([df1, df2], ignore_index=True, keys=['', ''])

# print the result
result.head(5)

,Restaurant ID,Restaurant Name,Country Code,City,Restaurant ID.1,Restaurant Name.1,Country Code.1,City.1
0,6317637.0,Le Petit Souffle,162.0,Makati City,NaN,NaN,NaN,NaN
1,6304287.0,Izakaya Kikufuji,162.0,Makati City,NaN,NaN,NaN,NaN
2,6300002.0,Heat - Edsa Shangri-La,162.0,Mandaluyong City,NaN,NaN,NaN,NaN
3,6318506.0,Ooma,162.0,Mandaluyong City,NaN,NaN,NaN,NaN
4,6314302.0,Sambo Kojin,162.0,Mandaluyong City,NaN,NaN,NaN,NaN

In [31]:
# drop the last four columns
result = result.drop(result.columns[-4:], axis=1)

In [32]:
result.shape

(80, 4)